leetcode_2456_most_popular_video_creator.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2456. Most Popular Video Creator</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">
</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2456. Most Popular Video Creator</h1>

<div id="outline-container-org04debc5" class="outline-2">
<h2 id="org04debc5">Understand the problem</h2>
<div class="outline-text-2" id="text-org04debc5">
<p>
Find the creators with max total views and their respective creation most viewed.  Views of a single creation don't aggregate if they appear multiple times in the report.
</p>
</div>
</div>

<div id="outline-container-org13d7029" class="outline-2">
<h2 id="org13d7029">Devise a plan</h2>
<div class="outline-text-2" id="text-org13d7029">
<p>
<a href="can_we_simulate_the_problem.html#ID-48E699CB-3125-47FF-AA1A-5FCCF0EF235E">Can we simulate the problem?</a> Yes! Compute the popularity while keeping track of the creation most viewed.
</p>
</div>

<div id="outline-container-org16d8a5c" class="outline-3">
<h3 id="org16d8a5c">Carry out the plan</h3>
<div class="outline-text-3" id="text-org16d8a5c">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">mostPopularCreator</span>(
        <span style="font-weight: bold;">self</span>, creators: List[<span style="font-weight: bold;">str</span>], ids: List[<span style="font-weight: bold;">str</span>], views: List[<span style="font-weight: bold;">int</span>]
    ) -&gt; List[List[<span style="font-weight: bold;">str</span>]]:
        <span style="font-weight: bold; font-style: italic;">popularity</span> = Counter()
        <span style="font-weight: bold; font-style: italic;">total_views</span> = defaultdict(Counter)
        <span style="font-weight: bold;">for</span> c, i, v <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">zip</span>(creators, ids, views):
            <span style="font-weight: bold; font-style: italic;">popularity</span>[<span style="font-weight: bold; font-style: italic;">c</span>] += v
            total_views[c][<span style="font-weight: bold; font-style: italic;">i</span>] = <span style="font-weight: bold;">max</span>(total_views[c][i], v)
        <span style="font-weight: bold; font-style: italic;">maxp</span> = <span style="font-weight: bold;">max</span>(popularity.values())
        <span style="font-weight: bold; font-style: italic;">ans</span> = []
        <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> popularity:
            <span style="font-weight: bold;">if</span> popularity[c] &lt; <span style="font-weight: bold; font-style: italic;">maxp</span>:
                <span style="font-weight: bold;">continue</span>
            maxv = <span style="font-weight: bold;">max</span>(total_views[c].values())
            ans.append([c, <span style="font-weight: bold;">min</span>(i <span style="font-weight: bold;">for</span> i, v <span style="font-weight: bold;">in</span> total_views[c].items() <span style="font-weight: bold;">if</span> v == maxv)])
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>